app/controllers/api/sessions_controller.rb

    def create
        user = User.find_by_credentials(params[:user][:username], params[:user][:password])
        if user
            login!(user)
            @user = user.slice(:id, :username)
            annotation_notifications = user.annotation_notifications.map do |notification|
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Eddie123"], ["LIMIT", 1]]