app/controllers/application_controller.rb

  def current_user
    return nil unless session[:session_token]
    if user = User.find_by_session_token(session[:session_token])
      cookies['user_id'] = user.id
    end
    @current_user ||= User.find_by_session_token(session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "zBJDX3rhRmvlG_n1W1KyAQ"], ["LIMIT", 1]]